List<String> getListOfGroup(String group) {
  switch (group) {
    case 'коричнево-красная':
    case 'коричнево-синяя':
    case 'коричневая':
      return [
        'коричнево-красная',
        'коричнево-синяя',
        'коричневая',
        'коричнево-белая',
        'бело-коричневая',
        'бело-красная',
        'бело-синяя',
        'белая',
        'сине-белая'
      ];
    case 'красно-синяя':
    case 'красно-белая':
    case 'красная':
      return ['синяя', 'сине-коричневая'];
    case 'красно-коричневая':
      return [
        'коричнево-белая',
        'сине-белая',
        'бело-коричневая',
        'бело-красная',
        'бело-синяя',
        'белая',
      ];
    case 'коричнево-белая':
      return [
        'коричнево-красная',
        'коричнево-синяя',
        'коричневая',
        'коричнево-белая',
        'бело-коричневая',
        'бело-красная',
        'бело-синяя',
        'белая',
        'сине-белая',
        'красно-коричневая',
      ];
    case 'синяя':
    case 'сине-коричневая':
      return ['красная', 'красно-белая', 'сине-красная', 'красно-синяя'];
    case 'сине-белая':
      return [
        'коричнево-красная',
        'коричнево-синяя',
        'коричневая',
        'коричнево-белая',
        'бело-коричневая',
        'бело-красная',
        'бело-синяя',
        'белая',
        'красно-коричневая',
      ];
    case 'сине-красная':
      return ['синяя', 'сине-коричневая'];
    case 'бело-красная':
    case 'бело-синяя':
    case 'белая':
    case 'бело-коричневая':
      return [
        'коричнево-красная',
        'коричнево-синяя',
        'коричневая',
        'коричнево-белая',
        'сине-белая',
        'красно-коричневая',
      ];
    default:
      return [];
  }
}
